Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ།
en: The bodhisattva Sarva­nīvaraṇa­viṣkam­bhin then inquired,

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པ་ལགས་སམ།
en: “Blessed One, have all sentient beings of that realm attained the state of irreversible progress?”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་མ་ཡིན་ནོ།
en: “No,” replied the Blessed One, “they have not.”

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སེམས་ཅན་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་མ་ཐོས་སམ།
en: “Blessed One, is it because they have not heard the name of that thus-gone one?”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཐོས་སོ།
en: “Noble son,” replied the Blessed One, “they have indeed heard that thus-gone one’s name.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཕྱིར་མི་ལྡོག་པ་མ་ལགས།
en: “In that case, why have they not yet attained the level of irreversible progress?”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དག་ཐམས་ཅད་ནི་ཕྱིར་མི་ལྡོག་པ་ཡང་ཡིན་ལ་ཕྱིར་ལྡོག་པ་ཡང་ཡིན་ནོ།
en: “Noble son,” replied the Blessed One, “the progress beings there make is irreversible, yet it is also reversible.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར། གང་དེ་ལྟ་བུར་དེ་དག་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པ་ཡང་ལགས་ལ། ཕྱིར་ལྡོག་པ་ཡང་ལགས།
en: “How, Blessed One, can it be both irreversible as well as reversible?”

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་པས། སེམས་ཅན་དེ་དག་གི་ཕྱིར་མི་ལྡོག་པའི་ས་བོན་སྐྱེས་པ་མཐོང་ནས་
en: “Noble son, I perceive that once they have heard the name of that thus-gone one the seed of irreversible progess is present within them.

source: སེམས་ཅན་དེ་དག་ཕྱིར་མི་ལྡོག་པར་ལུང་སྟོན་ཏོ།
en: Thus, they are definitively destined to make irreversible progress.

source: མཚན་ཐོས་པ་ཁོ་ནས་དེ་མ་ཐག་ཏུ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཡང་མ་ཡིན་ཏེ།
en: Yet their progress does not, because of that alone, immediately become irreversible.

source: དེ་བས་ན་རིགས་ཀྱི་བུ་དོན་དེ་ཉིད་རབ་ཏུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་དཔེ་བཤད་དོ།
en: Noble son, to demonstrate this point I shall give you an analogy.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཤིང་ལ་ལའི་ས་བོན་གྱི་རྣམ་པ་ཞིག་ཡོད་དེ།
en: Noble son, think of the seeds of a tree.

source: ས་བོན་དེ་ལ་ས་བོན་གྱི་ཉེས་པ་ཐམས་ཅད་མེད་ལ།
en: If those seeds are flawless,

source: མྱུ་གུ་སྐྱེ་བ་ནས་རྫོགས་པའི་བར་དུ་རྐྱེན་རྣམས་ཡོད་ན།
en: if all the conditions for growth, from sprouting through to completion, are present,

source: རིགས་ཀྱི་བུ་ས་བོན་དེ་ལ་ཇི་སྐད་ཅེས་བྱ། གསོལ་པ་བཅོམ་ལྡན་འདས་
en: then what would you call such seeds?” “Blessed One,

source: ཉེས་པ་ཐམས་ཅད་དང་བྲལ་བས་ན། དེ་ནི་ཡོངས་སུ་རྫོགས་པ་ཞེས་བགྱིའོ།
en: because they are entirely flawless, I would then call them ‘perfect.’

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་པ་དང་ལྡན་པའི་ཕྱིར་མི་ལྡོག་པའི་ས་བོན་ཡོད་པའི་སེམས་ཅན་རྣམས་ནི་
en: “Noble son, similarly, once they have heard the name of that thus-gone one, those sentient beings possess the seed of irreversible progress.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་ནོ།
en: And in that sense their progress to unexcelled and complete awakening has become irreversible.”

source: བཅོམ་ལྡན་འདས་བདག་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བལྟ་བ་དང་།
en: “Blessed One, I would like to go to that world called Endurance

source: དེ་ལའང་ཕྱག་འཚལ་བ་དང་།
en: so that I can prostrate before

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་
en: the blessed, thus-gone, worthy, perfect buddha Śākyamuni.

source: བསྙེན་བཀུར་བགྱི་བ་དང་། བཙུན་པར་བགྱི་བ་དང་། རི་མོར་བགྱི་བ་དང་།
en: I wish to venerate, honor, and revere him.

source: བཀུར་སྟི་བགྱི་བ་དང་། མཆོད་པ་བགྱི་བའི་སླད་དུ་མཆིའོ། །དེ་སྐད་ཅེས་གསོལ་པ་
en: I wish to praise him and offer him worship.”

source: རིགས་ཀྱི་བུ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་ཁྱོད་སོང་ཤིག
en: “Noble son, if you know that the time has come, you may leave.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that point all the bodhisattvas addressed the blessed thus-gone Padma­netra:

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བལྟ་བ་དང་།
en: “Blessed One, we also wish to see that world called Endurance.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ལ་ཡང་ཕྱག་འཚལ་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། བཙུན་པར་བགྱི་བ་དང་། རི་མོར་བགྱི་བ་དང་། བཀུར་སྟི་བགྱི་བ་དང་། མཆོད་པ་བགྱི་བའི་སླད་དུ་མཆིའོ།
en: We also wish to prostrate before the blessed, thus-gone, worthy, perfect buddha Śākyamuni. We also wish to venerate, honor, and revere him. We also wish to praise him and offer him worship.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: In reply, the blessed thus-gone Padma­netra said to them,

source: རིགས་ཀྱི་བུ་དག་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་ཁྱོད་དེང་ཤིག
en: “Children of noble family, if you know that the time has come, you may leave.

source: འཇིག་རྟེན་གྱི་ཁམས་དེར་བག་ཡོད་པར་གནས་པས་གནས་པར་གྱིས་ཤིག
en: But once you are in that realm, be careful.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་དེ་དག་ནི་རབ་ཏུ་འདོད་ཆགས་མང་བ། ཞེ་སྡང་མང་བ། གཏི་མུག་མང་བ།
en: Why? Because among the beings of that realm desire, anger, and dullness are rife.

source: དགེ་སྦྱོང་དུ་མི་འཛིན་པ། བྲམ་ཟེར་མི་འཛིན་པ།
en: They have no regard for mendicants and no regard for brahmins.

source: ཕར་མི་ཤེས་པ། མར་མི་ཤེས་པ།
en: They have no concern for their fathers, no concern for their mothers.

source: ཆོས་མ་ཡིན་པ་འདོད་པ་མང་བ།
en: Numerous are their wishes that run counter to the Dharma.

source: བརླང་བ། གཏུམ་པ། ཞེ་གཅོད་པ།
en: They are spiteful, savage, and malicious.

source: མུ་ཅོར་སྨྲ་བ། ཕོ་ཐེག་ཅན། གཡེངས་པ། བརྐམ་པ།
en: They are impudent and haughty, easily carried away, and full of craving.

source: ལེ་ལོ་ཅན། ངན་པའི་ངང་ཚུལ་ཅན། སྡིག་པའི་ཆོས་ཅན།
en: They are lazy, unkind, and evil.

source: ཕྲག་དོག་དང་སེར་སྣས་ཡོངས་སུ་དཀྲིས་པ། ཉོན་མོངས་པ་དུ་མས་ཉེ་བར་ཉོན་མོངས་པར་གྱུར་པ་རྣམས་ཏེ།
en: They are tied down by envy and miserliness and suffer from an abundance of afflictions.

source: སེམས་ཅན་དེ་འདྲ་བ་དེ་དག་གི་ནང་ན་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་ཏོ།
en: It is among such beings that that thus-gone one teaches the Dharma.”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་
en: “Blessed One,” replied the bodhisattvas,

source: གང་འདི་འདྲ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ནང་ན་ཆོས་སྟོན་པ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་དཀའ་བ་མཛད་པ་ལགས་སོ།
en: “teaching the Dharma among such sentient beings is a tremendous feat displayed by that thus-gone one.”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ།
en: “Yes, it is,” the Blessed One agreed.

source: རིགས་ཀྱི་བུ་དག་དེ་བཞིན་ཏེ། གང་འདི་འདྲ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ནང་ན་ཆོས་སྟོན་པ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་དཀའ་བ་མཛད་པ་ཡིན་ནོ།
en: “Noble children, teaching the Dharma among such sentient beings is indeed a tremendous feat displayed by that thus-gone one.

source: རིགས་ཀྱི་བུ་དག་གང་དེ་ལྟ་བུར་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་
en: Moreover, noble children, when sentient beings within such a world of rampant afflictions

source: དགེ་བའི་སེམས་གཅིག་ཙམ་བསྐྱེད་པའི་སེམས་ཅན་དེ་དག་ཀྱང་དཀའ་བ་བྱེད་པ་ཡིན་ནོ།
en: give rise to just a single virtuous mind state then they also display a tremendous feat.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ཡོངས་སུ་དག་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཡོངས་སུ་དག་པ་ཡོད་པ་ལྟ་ཅི་མཚར་ཀྱི།
en: Why? Well, what would be amazing about finding pure beings in pure worlds?

source: གང་དག་དེ་ལྟར་
en: On the other hand,

source: ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་
en: in a world of rampant afflictions

source: སེ་གོལ་གཏོགས་པ་སྲིད་དུ་ཡང་དད་པ་རྙེད་པ་དང་།
en: is able, ever so briefly, to engender faith,

source: སྲིད་དུ་ཡང་སངས་རྒྱས་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། ཆོས་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། སེ་གོལ་གཏོགས་པ་སྲིད་དུ་ཡང་ཚུལ་ཁྲིམས་ཡང་དག་པར་བཟུང་སྟེ།
en: or go for refuge in the Buddha, Dharma, and Saṅgha, or purely observe discipline.

source: སྤྱོད་པ་འདི་ནི་ཆེས་ངོ་མཚར་ཏོ། །དེ་བས་ཀྱང་གང་དག་སེ་གོལ་གཏོགས་པ་སྲིད་དུ་ཡང་
en: However, it is an even greater wonder if, even for just a moment,

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པའི་སེམས་ཡང་དག་པར་བཟུང་སྟེ་
en: they can attain a mind free from desire.

source: གནས་པ་འདི་ནི་ཆེས་ངོ་མཚར་ཏོ། །དེ་བས་ཀྱང་གང་དག་སེ་གོལ་གཏོགས་པ་སྲིད་དུ་ཡང་སྙིང་རྗེ་བའི་སེམས་ཉེ་བར་གཞག་སྟེ།
en: Still, the greatest wonder of all is if they can briefly develop compassion

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་
en: and give rise to the mind of unexcelled and complete awakening.”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ།
en: “The Blessed One is amazing!” the bodhisattvas responded.

source: བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ།
en: “The Thus-Gone One is amazing!”

source: དེ་ནས་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱིས་ལེགས་སོ།
en: Sarva­nīvaraṇa­viṣkam­bhin and the other bodhisattvas then said, “Excellent, Blessed One.”

source: བཅོམ་ལྡན་འདས་དེ་ལས་འདི་ལྟ་བུ་འཐུན་པའི་རྗེས་སུ་བསྟན་པ་དེ་མཉན་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: And so, having bowed their heads to the feet of the buddha who had instructed them in this way,

source: རང་རང་གི་གནས་ནས་དོང་ངོ་།
en: each of them rose from the place where they had been sitting.

source: དོང་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པའི་ཕྱིར་ལ་ལས་ནི་
en: In order to bring offerings to the blessed Śākyamuni,

source: རིན་པོ་ཆེའི་ཤིང་མེ་ཏོག་དང་བཅས་པ། འབྲས་བུ་དང་བཅས་པ། ཆུ་དང་ཞེང་དུ་ལྡན་པ་རྣམས་མངོན་པར་སྤྲུལ།
en: some of the bodhisattvas emanated forth jewel trees, complete with flowers and fruits, and perfect in their height and circumference.

source: ལ་ལས་ནི་བཻ་དཱུརྱའི་ཤིང་རྣམས། ལ་ལས་ནི་ཤེལ་གྱི་ཤིང་རྣམས།
en: Some brought forth trees of beryl, some trees of crystal;

source: ལ་ལས་ནི་དཔག་བསམ་གྱི་ཤིང་རྣམས། ལ་ལས་ནི་གསེར་གྱི་ཤིང་རྣམས།
en: some brought forth wish-fulfilling trees, and others brought forth trees of gold.

source: ལ་ལས་ནི་མེ་ཏོག་གི་ཤིང་རྣམས། ལ་ལས་ནི་འབྲས་བུའི་ཤིང་རྣམས།
en: Some produced trees in bloom; some brought forth trees bearing fruit.

source: ལ་ལས་ནི་གོས་ཀྱི་སྤྲིན་རྣམས། ལ་ལས་ནི་རྒྱན་གྱི་སྤྲིན་རྣམས། ལ་ལས་ནི་སྤོས་ཀྱི་སྤྲིན་རྣམས། ལ་ལས་ནི་ཕྲེང་བའི་སྤྲིན་རྣམས། ལ་ལས་ནི་ཕྱེ་མའི་སྤྲིན་རྣམས། ལ་ལས་ནི་གདུགས་ཀྱི་སྤྲིན་རྣམས། ལ་ལས་ནི་རྒྱལ་མཚན་གྱི་སྤྲིན་རྣམས། ལ་ལས་ནི་སིལ་སྙན་གྱི་སྤྲིན་རྣམས་མངོན་པར་སྤྲུལ་ཏེ།
en: Some emanated a cloud of precious fabric, some a cloud of ornaments, some a cloud of incense, some a cloud of garlands, some a cloud of powders, some a cloud of parasols, some a cloud of banners, and some a cloud of cymbals.

source: མངོན་པར་སྤྲུལ་ནས་གཅིག་ཏུ་འདུས་ཏེ།
en: Having brought together all these emanated offerings,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་ལྷན་ཅིག་ཏུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ག་ལ་བ་དེར་དོང་ངོ་།
en: the bodhisattvas then gathered and traveled along with Sarva­nīvaraṇa­viṣkam­bhin to the world called Endurance.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Once there, the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin exclaimed,

source: ཀྱེ་མའོ་གྲོགས་པོ་དག་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ལོ།
en: “Friends, alas, the sentient beings of this world called Endurance are suffering!

source: དེ་བས་ན་གང་གིས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བདེ་བ་མཆོག་གིས་བསྟབས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་བྱ་བ་ལེགས་པར་མངོན་པར་བྱའོ།
en: Therefore, let us bring forth a magical display that delivers the highest bliss to all these sentient beings!”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ཀུན་གྱིས་ལེགས་སོ་ཞེས་སྨྲས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བའི་ལྟར་མཉན་ཏོ།
en: “So be it!” replied all the bodhisattvas, and so they followed the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin’s suggestion.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་བྱ་བ་མངོན་པར་བྱས་པས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བའི་ལུས་ལས་འོད་དང་བ།
en: Hence, as a magical manifestation, there appeared a brilliant light from the body of the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin.

source: དྲི་མ་མེད་པ། རྣམ་པར་དག་པ། ཡིད་དུ་འོང་བ།
en: Bright, immaculate, and delightful,

source: ལུས་དང་སེམས་ཤིན་ཏུ་དགའ་བར་བྱེད་པ་བྱུང་སྟེ།
en: the light was utterly gratifying to the body and mind

source: འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཁྱབ་ཅིང་སྣང་བར་གྱུར་པ་དང་།
en: as it pervaded and illumined the entire trichiliocosm.

source: གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སེམས་ཅན་དམྱལ་བ་པའི་ལུས་སུ་གནས་པ་དང་།
en: As this light touched them, all the sentient beings within that trichiliocosm who had the body of a being in hell,

source: བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་ལུས་སུ་གནས་པ་དང་།
en: or who had a body belonging to the animal realm,

source: གཤིན་རྗེའི་འཇིག་རྟེན་པའི་ལུས་སུ་གནས་པ་དེ་དག་འོད་དེས་རེག་ནས་སྡུག་བསྔལ་གྱི་ཚོར་བ་དང་བྲལ་ཏེ། བདེ་ཞིང་
en: or a body belonging to the realm of the Lord of Death were freed from their feelings of pain, and instead they found happiness.

source: ཁྲོ་བ་དང་གནོད་སེམས་དང་ཡང་བྲལ་ཏེ་ཕན་ཚུན་དུ་ཕ་མར་འདུ་ཤེས་པར་གྱུར་པ་དང་།
en: They were also freed from anger and ill will, and they began to regard one another as they would their parents.

source: གང་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་འཇིག་རྟེན་གྱི་བར་མུན་པ་མུན་ནག་
en: Within that trichiliocosm all the dense darkness that exists between the worlds

source: གང་དུ་ཉི་མ་དང་། ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ་འདི་ལྟར་མཐུ་ཆེ་བ། འདི་ལྟར་དབང་ཆེ་བར་གྲགས་པ་འདི་དག་གིས་ཀྱང་ལམ་མེ། ལྷན་ནེ་ལྷང་ངེར་མ་གྱུར་པ་
en: —that which cannot be brightened, illumined, or lit up by the sun or the moon, which are otherwise so famed for their miraculous power and force

source: དེ་དག་ཀྱང་འོད་དེས་ཁྱབ་ནས་སྣང་བར་གྱུར་ཏེ། གང་དེར་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་གཅིག་གིས་གཅིག་མཐོང་བ་དང་།
en: —was now also permeated by that light so that all the beings who lived there could see one another.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་གང་ཁོར་ཡུག་གི་རི་རྣམས་དང་། ཁོར་ཡུག་གི་རི་ཆེན་པོ་རྣམས་དང་།
en: Within that trichiliocosm all the surrounding mountain ranges, great mountain ranges,

source: རི་བཏང་བཟུང་དང་། རི་བཏང་བཟུང་ཆེན་པོ་རྣམས་དང་། དེ་མ་ཡིན་པའི་རི་ནག་པོ་གཞན་དེ་དག་ཀྱང་
en: Mucilinda Mountains, and Mahā­muci­linda Mountains, along with all the other dark mountains,

source: འོད་དེས་ཁྱབ་སྟེ་སྣང་བར་གྱུར་པ་དང་།
en: were now also pervaded and illumined by the light.

source: བླར་ནི་ཚངས་པའི་འཇིག་རྟེན་མན་ཆད། འོག་ཏུ་ནི་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཡན་ཆད་དེའི་བར་དུ་
en: From the Realm of Brahmā above, down to the realm of the beings in the Hell of Incessant Pain below,

source: གང་འོད་དེས་སྣང་བར་མ་བྱས་པའི་ས་ཕྱོགས་དེ་གང་ཡང་མེད་པ་
en: there was not a single spot that was not perfectly illumined by that great light

source: དེ་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་གིས་ཀྱང་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་བྱ་བ་མངོན་པར་བྱས་པས་
en: Each of the other bodhisattvas also brought forth magical emanations.

source: ཟས་འདོད་པའི་སེམས་ཅན་རྣམས་ནི་ཟས་ཐོབ། བཏུང་བ་འདོད་པ་རྣམས་ནི་བཏུང་བ།
en: Hence, every sentient being wishing for food received sustenance, and whoever wished for drink received refreshment.

source: གོས་འདོད་པ་རྣམས་ནི་གོས། བཞོན་པ་འདོད་པ་རྣམས་ནི་བཞོན་པ། ནོར་འདོད་པ་རྣམས་ནི་ནོར་ཐོབ།
en: Those desiring clothes received clothing, those wanting a mount received one, and those wishing for wealth found riches.

source: ལོང་བ་རྣམས་ནི་མིག་ཐོབ། འོན་པ་རྣམས་ནི་སྒྲ་ཐོས།
en: The blind gained their sight and the deaf could hear.

source: སྒྲེན་མོ་རྣམས་ནི་གོས་ཅན་དུ་གྱུར། སྨྱོས་པ་རྣམས་ནི་དྲན་པ་ཐོབ། སྡུག་བསྔལ་བ་རྣམས་ནི་བདེ་བར་གྱུར། སྦྲུམ་པ་རྣམས་ནི་བདེ་བར་བཙས་པ་
en: The naked received fine garments, the insane regained their senses, those in pain became well, and those in labor gave birth easily.

source: དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་བྱ་བ་མངོན་པར་བྱས་སོ།
en: Such were the effects of their miraculous activities.

source: དེ་ནས་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཡུལ་ག་ཡ་དང་ག་ཡ་མགོའི་རི་ག་ལ་བ་དེར་ཉེ་བ་དང་།
en: The bodhisattva Sarva­nīvaraṇa­viṣkam­bhin and all the other bodhisattvas then proceeded to Gayā and Gayā­śīrṣa Hill.

source: སྐྱེས་བུ་དམ་པ་དེ་དག་ཉེ་བར་གྱུར་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེའི་དྲ་བས་ཁེབས་པར་ཀུན་ཏུ་སྣང་ངོ་།
en: As soon these holy beings were approaching, a net of jewels appeared, bedecking the entire trichiliocosm,

source: སྟེང་གི་བར་སྣང་ལས་ཀྱང་ལྷའི་པད་མའི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ།
en: and a rain of divine lotus flowers fell from the sky.

source: གྱི་ཆར་མངོན་པར་རབ་ཏུ་བབ་བོ།
en: Rain fell from

source: ལྷའི་མེ་ཏོག་གི་སྤྲིན་རྣམས་དང་། ལྷའི་ཤིང་ཏོག་གི་སྤྲིན་རྣམས་དང་། ལྷའི་ཕྲེང་བའི་སྤྲིན་རྣམས་དང་། ལྷའི་སྤོས་ཀྱི་སྤྲིན་རྣམས་དང་། ལྷའི་གོས་ཀྱི་སྤྲིན་རྣམས་དང་། ལྷའི་ཕྱེ་མའི་སྤྲིན་རྣམས་དང་། ལྷའི་ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་སྤྲིན་
en: clouds of divine flowers, clouds of divine fruits, clouds of divine garlands, clouds of divine incense, clouds of divine garments, clouds of divine powders, and clouds of divine Dharma robes, divine umbrellas, divine banners, and divine standards.

source: དེ་དག་མངོན་པར་རབ་ཏུ་བབ་པས་སེམས་ཅན་གང་ལ་རེག་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་བདེ་བར་གྱུར།
en: As this divine rain was falling, all the beings who were touched by it felt blissful.

source: ཡུལ་ག་ཡ་དང་ག་ཡ་མགོའི་རི་ལ་ཤིང་ཐ་མལ་པ་དང་། ས་ཕྱོགས་ཐ་མལ་པ་གང་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མེད་པར་སྣང་ངོ་།
en: All the ordinary trees and soil of the region of Gayā and Gayā­śīrṣa now disappeared,

source: ས་ཕྱོགས་དེ་དག་ན་རིན་པོ་ཆེའི་ཤིང་རྣམས་དང་། དཔག་བསམ་གྱི་ཤིང་རྣམས་དང་། མེ་ཏོག་གི་ཤིང་རྣམས་དང་། འབྲས་བུའི་ཤིང་རྣམས་དང་། ཙན་དན་གྱི་ཤིང་རྣམས་དང་། ཨ་ག་རུའི་ཤིང་རྣམས་ཀུན་ཏུ་སྣང་སྟེ།
en: instead the land was filled with trees of jewels, wish-fulfilling trees, flowering trees, fruit-bearing trees, sandalwood trees, and aloeswood trees,

source: དེ་དག་ཀུན་ཏུ་བཟང་པོར་འདུག་པར་གྱུར་ཏོ།
en: the land was in all regards excellent.

source: བར་སྣང་ལས་ལྷའི་སིལ་སྙན་དག་སྒྲ་འབྱིན་ཅིང་། སིལ་སྙན་དེ་དག་ལས་འདི་ལྟ་བུའི་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་བྱུང་ངོ་།
en: From the sky divine instruments were heard, and as they played they produced these verses:

source: ལུམ་བིའི་ཚལ་རབ་མཆོག་ཏུ་གང་སྐྱེས་པ། །མཉམ་མེད་གཞར་ཡང་ཉོན་མོངས་དབང་མི་འགྱུར། །
en: “Born at the perfect site, the garden of Lumbinī, He has no equal, not being subject to any affliction—

source: ནམ་མཁའ་མཚུངས་མཉམ་དེ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship the one who is equal to space.

source: བྱང་ཆུབ་མཆོག་སུས་བྱང་ཆུབ་ཤིང་དབང་དྲུང་། །བདུད་ཀྱི་སྡེ་སྟོབས་བཅོམ་ནས་སངས་རྒྱས་པ། །
en: “At the tree of awakening he gained perfect awakening, Crushed the power of the māras, and became a buddha—

source: དྲི་མེད་གཟི་ལྡན་དེ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship the one who is stainless and splendid.

source: ཆོས་ཚུལ་འདི་དག་སྒྱུ་མ་སྨིག་རྒྱུ་དང་། །ཆུ་ཟླ་འདྲ་བར་གང་གིས་རྟོགས་གྱུར་པ། །
en: “All phenomena he realizes To be like an illusion, a visual distortion, and a reflection of the moon in water—

source: བསོད་ནམས་ཞིང་རབ་དེ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship this finest field of merit.

source: ཆོས་རྣམས་སྣ་ཚོགས་འཇའ་དང་འདྲ་བ་དང་། །གར་མཁན་ཚོན་འདྲར་གང་གིས་རབ་རྟོགས་པ། །
en: “All the different phenomena he realizes To be like rainbows, or a dancer’s mask—

source: མི་གཡོ་བསོད་ནམས་གཏེར་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship the treasure of immutable merit.

source: གང་གིས་བསྐལ་པ་བརྒྱ་ཕྲག་མང་པོར་ནི། །ཐུགས་རྗེའི་ཐུགས་ཀྱིས་ཚོགས་ཀུན་རྫོགས་མཛད་པ། །
en: “Throughout many hundreds of eons he has perfected The accumulations by means of his compassionate mind—

source: དྲི་མེད་ཟླ་ཞལ་དེ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས།
en: Here we have arrived at this most excellent mountain To worship the one whose face is like a stainless moon.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བརྒྱ་མང་དང་། །ལྷ་ཡི་ཚོགས་ཀྱིས་དེ་བཞིན་གང་མཆོད་པ། །
en: “Venerated he is by billions of bodhisattvas As well as by the hosts of the gods—

source: གཏི་མུག་མུན་བྲལ་དེ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship the one who is free from the darkness of unknowing.

source: གང་གིས་མཆོག་གི་ཆོས་ཀྱི་གཏེར་བརྙེས་ཤིང་། །ཐུགས་རྗེ་ཉིད་ཀྱིས་འཇིག་རྟེན་དག་ལ་བཏང་། །
en: “Having discovered the treasure of sublime Dharma, Out of compassion he distributes it in the world—

source: མཉམ་མེད་ཕན་མཛད་དེ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship the one who benefits beyond compare.

source: གང་ཞིག་ཐུགས་ཞི་རྟག་པར་བྱམས་པའི་ཡིད། །པད་མ་ཆུས་ལྟར་ཉོན་མོངས་མ་གོས་པ། །
en: “With his peaceful mind of constant love, He is unstained by afflictions, like a lotus unstained by the water—

source: ཡོན་ཏན་མཆོག་རབ་མངའ་ལ་ཕྱག་འཚལ་དུ། །རི་བོ་མཆོག་རབ་འདི་ལ་བདག་ཅག་ལྷགས། །
en: Here we have arrived at this most excellent mountain To worship the one who masters supreme qualities.

source: མཚན་གྱི་མེ་ཏོག་རྒྱས་པ་ཡོངས་སུ་དག་པའི་སྐུ། །དཔེ་བྱད་བཟང་པོའི་འབྲུ་ཆགས་འགྲོ་བའི་འཚོ་བ་གང་། །
en: “His pure body, adorned with the blossoms of perfect marks, Sustains wandering beings with the grains of excellent signs—

source: ཡལ་ག་མཐའ་ཡས་རིན་ཆེན་ཤིང་ལ་ཕྱག་འཚལ་དུ། །བདག་ཅག་ཐམས་ཅད་ལྷན་ཅིག་མཆོད་པ་ཐོགས་ཏེ་ལྷགས། །
en: Carrying offerings, here together we have arrived To worship this jewel tree that bears infinite branches.”

source: ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་མ་ཐག་ཏུ་དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་སྟན་ལས་ལངས་ཏེ།
en: As soon as these verses were heard, the venerable Mahā­maud­galyā­yana rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Joining his palms, he bowed toward the Blessed One and said,

source: བཅོམ་ལྡན་འདས་སྔོན་མ་ཐོས་སྔོན་མ་མཐོང་བའི་སྔ་ལྟས་གདའ་བ་འདི་དག་སུའི་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: “Blessed One, we are witnessing many unprecedented sounds and sights. Whose signs are all these?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One replied to the venerable Mahā­maud­galyā­yana,

source: མཽད་གལ་གྱི་བུ་ཤར་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་
en: “Maud­galyā­yana, to the east, beyond as many worlds as there are grains of sand in the river Gaṅgā,

source: འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: there is a world known as Realm of Lotuses.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་སྤྱན་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་སོ།
en: There at present resides the thus-gone, worthy, perfect buddha Padma­netra.

source: འཚོའོ། །གཞེས་སོ། །ཆོས་ཀྱང་སྟོན་ཏོ།
en: Residing and flourishing in that realm, he also teaches the Dharma.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་འོངས་པ་དང་།
en: Now the bodhisattva great being Sarva­nīvaraṇa­viṣkam­bhin has come to this world called Endurance from the buddha realm of that thus-gone one.

source: དེ་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཞན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གང་སྐྱེས་བུ་དམ་པ་དེ་ཉིད་དང་ལྷན་ཅིག་ཏུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་པ་དེ་དག་གི་སྔ་ལྟས་འདི་ཡིན་ནོ།
en: This holy being is arriving here accompanied by one hundred sextillion other bodhisattvas, and what you perceive are the signs of their arrival.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་མ་ཐག་ཏུ།
en: As soon as the Blessed One had spoken,

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin, surrounded and venerated by a retinue of one hundred sextillion bodhisattvas,
